// uploadQuestions.js
import { db } from "./firebase";
import { collection, setDoc, doc } from "firebase/firestore";

// Масив питань
const questionsUkr = [
  {
    id: 1,
    type: "single",
    question:
      "Без орфографічних помилок написано кожне словосполучення в рядку",
    options: [
      {
        id: 1,
        label:
          "піфагорова теорема, прокрустове ложе, Аріаднина нитка, Грінченків словник",
      },
      {
        id: 2,
        label:
          "Сергієві кошти, Нобелівська Премія, Святвечір, Верховний суд США",
      },
      { id: 3, label: "Різдво, Збройні Сили України, Успіння, Великий піст" },
      {
        id: 4,
        label:
          "картина «Квіти», журнал «Вісник», пам’ятка «Руська правда», День Незалежності України",
      },
    ],
    answer:
      "картина «Квіти», журнал «Вісник», пам’ятка «Руська правда», День Незалежності України",
  },
  {
    id: 2,
    type: "single",
    question:
      "Спрощення приголосних на письмі відбувається в усіх словах рядка",
    options: [
      { id: 1, label: "комендан..ство, виїз..ний, щотиж..нево" },
      { id: 2, label: "зліс..ний, ціліс..ний, хвас..ливий" },
      { id: 3, label: "перс..нями, буревіс..ник , капус..ний" },
      { id: 4, label: "гімназис..ці, доблес..ний, облас..ний" },
    ],
    answer: "перс..нями, буревіс..ник , капус..ний",
  },
  {
    id: 3,
    type: "single",
    question: "Подвоєння літер НЕ відбувається в усіх словах рядка",
    options: [
      { id: 1, label: "в…ійти, квартирн…ий, дан…ий, солов'їн…ий" },
      { id: 2, label: "зігран…ий, сумлін…ий, помітн...ий, шален...ий" },
      {
        id: 3,
        label: "від…зеркалювати, притаман...ий, мурашин…ий, підкладен…ий",
      },
      {
        id: 4,
        label: "неподо́лан…ий, обітован..ий, переказан...ий, буквен...й",
      },
    ],
    answer: "неподо́лан…ий, обітован..ий, переказан...ий, буквен...й",
  },
  {
    id: 4,
    type: "single",
    question: "Літеру Е на місці пропуску треба писати в усіх словах рядка",
    options: [
      { id: 1, label: "ст..хати, майст..р, леб..диний" },
      { id: 2, label: "мар..во, тр..мтіти, щеб..тання" },
      { id: 3, label: "пригв..нтити, чер..да, шел..стіти" },
      { id: 4, label: "ос..литися, к..шеня, л..дацюга" },
    ],
    answer: "мар..во, тр..мтіти, щеб..тання",
  },
  {
    id: 5,
    type: "single",
    question: "М’який знак на місці пропуску треба писати в усіх словах рядка",
    options: [
      { id: 1, label: "брин..чати, боягуз..кий, віднос..ся, різ..бярництво" },
      { id: 2, label: "їдален.., красун..чик, поділ..ський, кан..йон" },
      { id: 3, label: "зган..бити, обвін..чати, жен..шень, т..мяненький" },
      {
        id: 4,
        label: "Ман...чжурія, близ..кість, в клітин..ці, ізраїл..ський",
      },
    ],
    answer: "брин..чати, боягуз..кий, віднос..ся, різ..бярництво",
  },
  {
    id: 6,
    type: "single",
    question: "Виділені літери позначають однаковий звук у кожному слові рядка",
    options: [
      { id: 1, label: "коДекс, Дерево, Дзеркало" },
      { id: 2, label: "Сьогодні, піСня, Сік" },
      { id: 3, label: "Запонка, роЗмитий, куЗня" },
      { id: 4, label: "Криниця, воКзал, Корпусний" },
    ],
    answer: "Сьогодні, піСня, Сік",
  },
  {
    id: 7,
    type: "single",
    question:
      "НЕПРАВИЛЬНО виділено букви на позначення наголошених голосних у всіх словах, позначених цифрами. У цьому (1)виданнІ містяться праці різних (2)експЕртів про географію та (3)металургІю України, зокрема дослідження про (4)перЕпад температури, про течії та ліве (5)руслО річки Дніпро, про (6)болОтисту місцевість, (7)бурштИнові й рудневі поклади та (8)сільськогосподАрську культуру.",
    options: [
      { id: 1, label: "1, 3, 6, 7" },
      { id: 2, label: "3, 5, 6, 8" },
      { id: 3, label: "2, 4, 5, 6" },
      { id: 4, label: "1, 4, 7, 8" },
    ],
    answer: "1, 3, 6, 7",
  },
  {
    id: 8,
    type: "single",
    question: "Усі займенники пишуться через дефіс у рядку",
    options: [
      { id: 1, label: "аби/хто, будь/чий, котрий/сь, казна/який" },
      { id: 2, label: "казна/чий, скількох/небудь, хтозна/що, невідь/який" },
      { id: 3, label: "де/котрий, чий/небудь, будь/що, будь/чийого" },
      { id: 4, label: "ні/на/кому, хто/небудь, казна/скільки, ні/хто" },
    ],
    answer: "казна/чий, скількох/небудь, хтозна/що, невідь/який",
  },
  {
    id: 9,
    type: "single",
    question: "Спонукальним є речення",
    options: [
      { id: 1, label: "Де подінуться ваші мрії?" },
      {
        id: 2,
        label:
          "Вишитий рушник створює настрій, є взірцем людської працьовитості.",
      },
      { id: 3, label: "Намалюй мені днину, коли сідає сонце." },
      { id: 4, label: "А як чудово виглядає лісова галявина навесні!" },
    ],
    answer: "Намалюй мені днину, коли сідає сонце.",
  },
  {
    id: 10,
    type: "single",
    question: "Немає лексичної помилки в утворенні сполуки",
    options: [
      { id: 1, label: "домовитись у кінці кінців" },
      { id: 2, label: "ширина складає п'ять сантиметрів" },
      { id: 3, label: "я вірю в співпадіння" },
      { id: 4, label: "спадає на думку лише праця Потебні" },
    ],
    answer: "спадає на думку лише праця Потебні",
  },
  {
    id: 11,
    type: "single",
    question: "Редагування потребує речення",
    options: [
      {
        id: 1,
        label: "Послухавши подкаст психолога, захотілось записатись на прийом.",
      },
      { id: 2, label: "Приїхавши в столицю, мій друг знайшов собі роботу." },
      {
        id: 3,
        label: "Працюючи за комп'ютером, не забувайте робити зарядку для очей.",
      },
      {
        id: 4,
        label: "Степан Олексійович зустрів своє кохання, гулявши в парку.",
      },
      { id: 5, label: "Відвідуючи виставку, не фотографуйте картин." },
    ],
    answer: "Послухавши подкаст психолога, захотілось записатись на прийом.",
  },
  {
    id: 12,
    type: "single",
    question: "Пунктуаційну помилку допущено в кожному реченні, ОКРІМ",
    options: [
      {
        id: 1,
        label:
          "Наше сьогодення формується на засадах віри та патріотизму: люди живуть у тісному зв'язку з державою, й намагаються єднатися між собою.",
      },
      {
        id: 2,
        label:
          "Четверо кенійських співробітників, які погодилися відповісти на запитання журналістів розповіли, що ця робота їх морально травмувала.",
      },
      {
        id: 3,
        label:
          "Інфлюенсери будують своє життя в сильній взаємодії з аудиторією — любов до порад, до спілкування, до спільних заходів — пронизує всі ділянки блогерського життя.",
      },
      {
        id: 4,
        label:
          "Пандемія COVID-19 не закінчилася, і про це варто пам'ятати, проте існує вакцина та доступна бустерна доза, яка може захистити від смерті та важких випадків.",
      },
      {
        id: 5,
        label:
          "Термохімічне перетворення біомаси та відходів у синтетичний газ і органічні продукти може здійснюватися, і шляхом газифікації, і шляхом піролізу.",
      },
    ],
    answer:
      "Пандемія COVID-19 не закінчилася, і про це варто пам'ятати, проте існує вакцина та доступна бустерна доза, яка може захистити від смерті та важких випадків.",
  },
  {
    id: 13,
    type: "single",
    question:
      "Пряму мову в реченні правильно передано непрямою в рядку. Учителька зауважила: «Як і кожному освітянину, мені важливо знати, що про мене скажуть учні, як ставляться до моїх зауважень»",
    options: [
      {
        id: 1,
        label:
          "Учителька зауважила, що, як і кожному освітянину, мені важливо знати, що про мене скажуть учні, як вони сприймають мої зауваження.",
      },
      {
        id: 2,
        label:
          "Учителька зауважила, що, як і кожному освітянину, для неї важливо знати, що про мене скажуть учні, як сприймають її зауваження.",
      },
      {
        id: 3,
        label:
          "Учителька зауважила, що їй, як і кожному освітянину, важливо знати, що про нього скажуть учні, як вони сприймають його зауваження.",
      },
      {
        id: 4,
        label:
          "Учителька зауважила, що їй, як і кожному освітянину, важливо знати, що про них скажуть, як сприймають їхні ідеї.",
      },
      {
        id: 5,
        label:
          "Учителька зауважила, що, як і кожному освітянину, їй важливо знати, що про неї скажуть учні, як сприймають її ідеї.",
      },
    ],
    answer:
      "Учителька зауважила, що, як і кожному освітянину, їй важливо знати, що про неї скажуть учні, як сприймають її ідеї.",
  },
  {
    id: 14,
    type: "single",
    question: "Українським відповідником до іншомовного слова аналогія є",
    options: [
      { id: 1, label: "підсвідомість" },
      { id: 2, label: "цілковитість" },
      { id: 3, label: "відповідність" },
      { id: 4, label: "порівняння" },
      { id: 5, label: "посилання" },
    ],
    answer: "відповідність",
  },
  {
    id: 15,
    type: "single",
    question: "Граматичної помилки НЕМАЄ в реченні",
    options: [
      { id: 1, label: "Міссурі з’єднаний каналами з багатьма озерами." },
      { id: 2, label: "Андрійко не пішов до школи через сильну нежить." },
      {
        id: 3,
        label:
          "Мама в магазині купила соковитий авокадо, тушковану кольрабі, м’який сулугуні та солону путасу.",
      },
      {
        id: 4,
        label: "Військовий аташе вперше відправиться до гарячого Іраку.",
      },
      {
        id: 5,
        label:
          "Під час подорожі мої батьки відвідали справжнє японське кабукі.",
      },
    ],
    answer: "Військовий аташе вперше відправиться до гарячого Іраку.",
  },
  {
    id: 16,
    type: "single",
    question:
      "Укажіть правильний варіант заповнення пропусків ▶ Шановна ______________ ! Запрошую Вас на ___________________ день народження.",
    options: [
      { id: 1, label: "Анна Петрівна, мій" },
      { id: 2, label: "Анно Петрівно, мій" },
      { id: 3, label: "Анно Петрівна, мій" },
      { id: 4, label: "Анно Петрівно, моє" },
      { id: 5, label: "Анна Петрівно, моє" },
    ],
    answer: "Анно Петрівно, мій",
  },
  {
    id: 17,
    type: "single",
    question:
      "Укажіть правильний варіант заповнення пропусків ▶ Магазин морепродуктів ______ від нашого місцезнаходження, купимо _______ фугу?",
    options: [
      { id: 1, label: "за двадцять метрів, морожену" },
      { id: 2, label: "у двадцяти метрах, морожену" },
      { id: 3, label: "через двадцять метрів, морожене" },
      { id: 4, label: "за двадцять метрів, морожений" },
      { id: 5, label: "у двадцяти метрах, морожене" },
    ],
    answer: "за двадцять метрів, морожену",
  },
  {
    id: 18,
    type: "single",
    question:
      "Укажіть правильний варіант заповнення пропусків ▶ Женю, _______ біля _______ сьогодні _______ !",
    options: [
      { id: 1, label: "зустріньмося, ринку, в без двадцяти сім" },
      {
        id: 2,
        label: "давай зустрінемось, ринку, у вісім годин п'ятнадцять хвилин",
      },
      { id: 3, label: "давай зустрінемось, ринка, у двадцять хвилин на шосту" },
      { id: 4, label: "зустріньмося, ринку, о шістнадцятій двадцять" },
      { id: 5, label: "зустріньмося, ринка, за десять хвилин сьома" },
    ],
    answer: "зустріньмося, ринку, о шістнадцятій двадцять",
  },
  {
    id: 19,
    type: "single",
    question:
      "Укажіть правильний варіант заповнення пропусків ▶ Для відпочинку ми обрали _______ готель _______, де нас зустрів привітний _______.",
    options: [
      { id: 1, label: "самий затишний, Львова, консьєрж" },
      { id: 2, label: "найзатишніший, Львова, консьєрж" },
      { id: 3, label: "найбільш затишний, Львову, конс'єрж" },
      { id: 4, label: "найбільш затишніший, Львова, конс'єрж" },
      { id: 5, label: "найбільш затишний, Львову, консьєрж" },
    ],
    answer: "найзатишніший, Львова, консьєрж",
  },
  {
    id: 20,
    type: "single",
    question:
      "Укажіть правильний варіант заповнення пропусків ▶ Чотири _______ _______ року _______ іспити з математики.",
    options: [
      { id: 1, label: "студенти, протягом, здавали" },
      { id: 2, label: "студента, впродовж, складали" },
      { id: 3, label: "студенти, на протязі, складали" },
      { id: 4, label: "студенти, впродовж, складали" },
      { id: 5, label: "студента, протягом, здавали" },
    ],
    answer: "студенти, впродовж, складали",
  },
  {
    id: 21,
    type: "single",
    question: `Первісний текст буде відновлено, якщо речення розташувати в послідовності, запропонованій у рядку

💚Таке РІЗНОБАРВ'Я, на жаль, сприяє зміні клімату, адже тоді сніг менше відбиває сонячного світла та швидше розмерзає, через що у ньому розвивається дедалі більше яскравих водоростей і танення пришвидшується. 

🔶Ця рослина зимує під снігом у зеленому варіанті, а коли теплішає і сніг тане, опиняється ближче до поверхні, тому її забарвлення стає помаранчевим, пізніше колір змінюється на пурпуровий.

🔵Нещодавно біля наукової станції "Академік Вернадський", розташованій на мисі Марина острова Галіндез, сніжний покров змінив свій колір.

🟨Тому важливо щороку фіксувати площу "цвітіння снігу" на дослідних поверхнях, щоб побачити загальні тенденції впливу зміни клімату.

🔺Полярники пояснили, що це явище спричиняють мікроскопічні зелені одноклітинні водорості, що мають аж три кольорові _______.`,
    options: [
      { id: 1, label: "🔵🔺🔶💚🟨" },
      { id: 2, label: "🔵🔶🟨🔺💚" },
      { id: 3, label: "🔶🔵🟨💚🔺" },
      { id: 4, label: "💚🟨🔺🔶🔵" },
      { id: 5, label: "🟨💚🔵🔶🔺" },
    ],
    answer: "🔵🔺🔶💚🟨",
  },
  {
    id: 22,
    type: "single",
    question: `Виділене слово РІЗНОБАРВ'Я можна замінити всіма словами, ОКРІМ

💚Таке РІЗНОБАРВ'Я, на жаль, сприяє зміні клімату, адже тоді сніг менше відбиває сонячного світла та швидше розмерзає, через що у ньому розвивається дедалі більше яскравих водоростей і танення пришвидшується. 

🔶Ця рослина зимує під снігом у зеленому варіанті, а коли теплішає і сніг тане, опиняється ближче до поверхні, тому її забарвлення стає помаранчевим, пізніше колір змінюється на пурпуровий.

🔵Нещодавно біля наукової станції "Академік Вернадський", розташованій на мисі Марина острова Галіндез, сніжний покров змінив свій колір.

🟨Тому важливо щороку фіксувати площу "цвітіння снігу" на дослідних поверхнях, щоб побачити загальні тенденції впливу зміни клімату.

🔺Полярники пояснили, що це явище спричиняють мікроскопічні зелені одноклітинні водорості, що мають аж три кольорові _______.`,
    options: [
      { id: 1, label: "кольоровість" },
      { id: 2, label: "різнобокість" },
      { id: 3, label: "барвистість" },
      { id: 4, label: "квітчастість" },
      { id: 5, label: "різнокольоровість" },
    ],
    answer: "різнобокість",
  },
  {
    id: 23,
    type: "single",
    question: `Пунктуаційну помилку допущено в реченні

💚Таке РІЗНОБАРВ'Я, на жаль, сприяє зміні клімату, адже тоді сніг менше відбиває сонячного світла та швидше розмерзає, через що у ньому розвивається дедалі більше яскравих водоростей і танення пришвидшується. 

🔶Ця рослина зимує під снігом у зеленому варіанті, а коли теплішає і сніг тане, опиняється ближче до поверхні, тому її забарвлення стає помаранчевим, пізніше колір змінюється на пурпуровий.

🔵Нещодавно біля наукової станції "Академік Вернадський", розташованій на мисі Марина острова Галіндез, сніжний покров змінив свій колір.

🟨Тому важливо щороку фіксувати площу "цвітіння снігу" на дослідних поверхнях, щоб побачити загальні тенденції впливу зміни клімату.

🔺Полярники пояснили, що це явище спричиняють мікроскопічні зелені одноклітинні водорості, що мають аж три кольорові _______.`,
    options: [
      { id: 1, label: "💚" },
      { id: 2, label: "🔵" },
      { id: 3, label: "🔺" },
      { id: 4, label: "🔶" },
      { id: 5, label: "🟨" },
    ],
    answer: "🔵",
  },
  {
    id: 24,
    type: "single",
    question: `Вставне слово є в реченні

💚Таке РІЗНОБАРВ'Я, на жаль, сприяє зміні клімату, адже тоді сніг менше відбиває сонячного світла та швидше розмерзає, через що у ньому розвивається дедалі більше яскравих водоростей і танення пришвидшується. 

🔶Ця рослина зимує під снігом у зеленому варіанті, а коли теплішає і сніг тане, опиняється ближче до поверхні, тому її забарвлення стає помаранчевим, пізніше колір змінюється на пурпуровий.

🔵Нещодавно біля наукової станції "Академік Вернадський", розташованій на мисі Марина острова Галіндез, сніжний покров змінив свій колір.

🟨Тому важливо щороку фіксувати площу "цвітіння снігу" на дослідних поверхнях, щоб побачити загальні тенденції впливу зміни клімату.

🔺Полярники пояснили, що це явище спричиняють мікроскопічні зелені одноклітинні водорості, що мають аж три кольорові _______.`,
    options: [
      { id: 1, label: "💚" },
      { id: 2, label: "🔵" },
      { id: 3, label: "🔺" },
      { id: 4, label: "🔶" },
      { id: 5, label: "🟨" },
    ],
    answer: "💚",
  },
  {
    id: 25,
    type: "single",
    question: `Замість пропуску в одному з речень має бути слово

💚Таке РІЗНОБАРВ'Я, на жаль, сприяє зміні клімату, адже тоді сніг менше відбиває сонячного світла та швидше розмерзає, через що у ньому розвивається дедалі більше яскравих водоростей і танення пришвидшується. 

🔶Ця рослина зимує під снігом у зеленому варіанті, а коли теплішає і сніг тане, опиняється ближче до поверхні, тому її забарвлення стає помаранчевим, пізніше колір змінюється на пурпуровий.

🔵Нещодавно біля наукової станції "Академік Вернадський", розташованій на мисі Марина острова Галіндез, сніжний покров змінив свій колір.

🟨Тому важливо щороку фіксувати площу "цвітіння снігу" на дослідних поверхнях, щоб побачити загальні тенденції впливу зміни клімату.

🔺Полярники пояснили, що це явище спричиняють мікроскопічні зелені одноклітинні водорості, що мають аж три кольорові _______.`,
    options: [
      { id: 1, label: "пункти" },
      { id: 2, label: "види" },
      { id: 3, label: "стадії" },
      { id: 4, label: "частини" },
      { id: 5, label: "шматки" },
    ],
    answer: "стадії",
  },
  {
    id: 26,
    type: "matching",
    question: "Утворіть лексично правильні словосполучення.",
    pairs: {
      left: [
        "1. він навчився",
        "2. вона наслідувала",
        "3. вони опанували",
        "4. дякували",
      ],
      right: [
        "А. своєму викладачу",
        "Б. свого викладача",
        "В. чарам Ґоґвардса",
        "Г. чарів Ґоґвардса",
        "Д. чари Ґоґвардса",
      ],
    },
    answer: {
      1: "Г",
      2: "Б",
      3: "Д",
      4: "А",
    },
  },
  {
    id: 27,
    type: "matching",
    question:
      "Якими частинами мови є виділені слова в реченні (цифра позначає наступне слово)? У (1)переносному значенні «(2)байдики бити » означає (3)нічого не робити, нічим (4)не займатися.",
    pairs: {
      left: ["1.", "2.", "3.", "4."],
      right: [
        "А. прикметник",
        "Б. частка",
        "В. прислівник",
        "Г. іменник",
        "Д. займенник",
      ],
    },
    answer: {
      1: "А",
      2: "Г",
      3: "Д",
      4: "Б",
    },
  },
  {
    id: 28,
    type: "matching",
    question: "Доберіть приклад до кожного випадку вживання розділового знака",
    pairs: {
      left: [
        "1. кома при відокремленому означенні",
        "2. кома в складнопідрядному реченні",
        "3. кома в складносурядному реченні",
        "4. кома при відокремленій прикладці",
      ],
      right: [
        "А. Ми обрали непростий шлях, бо батько так велів.",
        "Б. Іван, наляканий громом, заховався в наметі.",
        "В. Почнеться сесія, засмучуючи студентів чіткими дедлайнами.",
        "Г. З'явилась вона, усмішка, після тривалого знайомства із самим собою.",
        "Д. Світ великий, і в ньому живе багато людей.",
      ],
    },
    answer: {
      1: "Б",
      2: "А",
      3: "Д",
      4: "Г",
    },
  },
  {
    id: 29,
    type: "matching",
    question: "Установіть відповідність типів складнопідрядного речення",
    pairs: {
      left: [
        "1. означальне",
        "2. з’ясувальне",
        "3. обставинне наслідку",
        "4. обставинне мети",
      ],
      right: [
        "А. Людина, що має чітку ціль, приречена на успіх.",
        "Б. Запилені книги чекали, щоб я нарешті їх прочитала.",
        "В. Дощ пройшов тут менший, так що ледь змокрів асфальт.",
        "Г. Я зайшов у телеграм, щоб відповісти  на всі твої питання.",
        "Д. Чим менша дитина, тим більше емоцій з нею треба зчитувати.",
      ],
    },
    answer: {
      1: "А",
      2: "Б",
      3: "В",
      4: "Г",
    },
  },
  {
    id: 30,
    type: "matching",
    question: "Доберіть антонім до кожного фразеологізму.",
    pairs: {
      left: [
        "1. співати дифірамби",
        "2. не нюхати пороху",
        "3. гнути спину",
        "4. в акурат",
      ],
      right: [
        "А. у свинячий голос",
        "Б. ні за холодну воду не братися",
        "В. потрапити у тенета",
        "Г. поливати помиями",
        "Д. стріляний горобець",
      ],
    },
    answer: {
      1: "Г",
      2: "Д",
      3: "Б",
      4: "А",
    },
  },
];

export const uploadQuestionsUkr = async () => {
  const questionsRef = collection(db, "questionsUkr");

  // Завантажуємо кожне питання в Firebase
  for (let question of questionsUkr) {
    await setDoc(doc(questionsRef, question.id.toString()), question);
  }

  console.log("Усі питання завантажено до Firestore ✅");
};
