// uploadQuestions.js
import { db } from "./firebase";
import { collection, setDoc, doc } from "firebase/firestore";

// Масив питань
const questionsUkr = [
  {
    id: 1,
    type: "single",
    question:
      'Прочитайте текст: У реченні 5 на місці пропуску можна написати всі слова, ОКРІМ\n\n(1) Чи завжди видатні компанії ухвалюють геніальні рішення? \n(2) Насправді найбільші корпорації світу зазнавали невдачі зі своїми новими ідеями. \n(3) Так компанія "Гугл" не виправдала всіх свої очікувань із новинкою – окулярами з вбудованою операційною системою. \n(4) Користувачі просто не захотіли постійно носити на обличчі те, що має свої "МІЗКИ". \n(5) А УПРАВЛІННЯ з аеронавтики "Наса" запускало близько 50 космічних апаратів, які навіть не змогли подолати силу земного тяжіння й вибухали на ...... для старту. \n(6) Так само зазнала поразки і ідея "ПЕПСІ" – вони презентували прозорий напій без кофеїну, одразу відкинутий лояльною аудиторією компанії. \n(7) Що ж відрізняє великі КОМПАНІЇ у момент краху? \n(8) Вони знаходять у поразці ДОСВІД, результати і показники якого можна дослідити, оцінити і взяти в роботу для створення чогось нового.',
    options: [
      {
        id: 1,
        label: "платформі",
      },
      {
        id: 2,
        label: "майданчику",
      },
      {
        id: 3,
        label: "площадці",
      },
      {
        id: 4,
        label: "плаці",
      },
    ],
    answer: "площадці",
  },
  {
    id: 2,
    type: "single",
    question:
      'Прочитайте текст: У НАЗИВНОМУ відмінку вжите виділене слово\n\n(1) Чи завжди видатні компанії ухвалюють геніальні рішення?\n(2) Насправді найбільші корпорації світу зазнавали невдачі зі своїми новими ідеями.\n(3) Так компанія "Гугл" не виправдала всіх свої очікувань із новинкою – окулярами з вбудованою операційною системою.\n(4) Користувачі просто не захотіли постійно носити на обличчі те, що має свої "МІЗКИ".\n(5) А УПРАВЛІННЯ з аеронавтики "Наса" запускало близько 50 космічних апаратів, які навіть не змогли подолати силу земного тяжіння й вибухали на ...... для старту.\n(6) Так само зазнала поразки і ідея "ПЕПСІ" – вони презентували прозорий напій без кофеїну, одразу відкинутий лояльною аудиторією компанії.\n(7) Що ж відрізняє великі КОМПАНІЇ у момент краху?\n(8) Вони знаходять у поразці ДОСВІД, результати і показники якого можна дослідити, оцінити і взяти в роботу для створення чогось нового.',
    options: [
      {
        id: 1,
        label: "мізки",
      },
      {
        id: 2,
        label: "управління",
      },
      {
        id: 3,
        label: '"Пепсі"',
      },
      {
        id: 4,
        label: "компанії",
      },
      {
        id: 5,
        label: "досвід",
      },
    ],
    answer: "управління",
  },
  {
    id: 3,
    type: "single",
    question:
      'Прочитайте текст: Пунктуаційну помилку допущено у реченні\n\n(1) Чи завжди видатні компанії ухвалюють геніальні рішення?\n(2) Насправді найбільші корпорації світу зазнавали невдачі зі своїми новими ідеями.\n(3) Так компанія "Гугл" не виправдала всіх свої очікувань із новинкою – окулярами з вбудованою операційною системою.\n(4) Користувачі просто не захотіли постійно носити на обличчі те, що має свої "МІЗКИ".\n(5) А УПРАВЛІННЯ з аеронавтики "Наса" запускало близько 50 космічних апаратів, які навіть не змогли подолати силу земного тяжіння й вибухали на ...... для старту.\n(6) Так само зазнала поразки і ідея "ПЕПСІ" – вони презентували прозорий напій без кофеїну, одразу відкинутий лояльною аудиторією компанії.\n(7) Що ж відрізняє великі КОМПАНІЇ у момент краху?\n(8) Вони знаходять у поразці ДОСВІД, результати і показники якого можна дослідити, оцінити і взяти в роботу для створення чогось нового.',
    options: [
      {
        id: 1,
        label: "третьому",
      },
      {
        id: 2,
        label: "четвертому",
      },
      {
        id: 3,
        label: "п'ятому",
      },
      {
        id: 4,
        label: "шостому",
      },
    ],
    answer: "шостому",
  },
  {
    id: 4,
    type: "single",
    question:
      'Прочитайте текст: Кома в реченні 6 стоїть\n\n(1) Чи завжди видатні компанії ухвалюють геніальні рішення?\n(2) Насправді найбільші корпорації світу зазнавали невдачі зі своїми новими ідеями.\n(3) Так компанія "Гугл" не виправдала всіх свої очікувань із новинкою – окулярами з вбудованою операційною системою.\n(4) Користувачі просто не захотіли постійно носити на обличчі те, що має свої "МІЗКИ".\n(5) А УПРАВЛІННЯ з аеронавтики "Наса" запускало близько 50 космічних апаратів, які навіть не змогли подолати силу земного тяжіння й вибухали на ...... для старту.\n(6) Так само зазнала поразки і ідея "ПЕПСІ" – вони презентували прозорий напій без кофеїну, одразу відкинутий лояльною аудиторією компанії.\n(7) Що ж відрізняє великі КОМПАНІЇ у момент краху?\n(8) Вони знаходять у поразці ДОСВІД, результати і показники якого можна дослідити, оцінити і взяти в роботу для створення чогось нового.',
    options: [
      {
        id: 1,
        label: "при відокремленій обставині",
      },
      {
        id: 2,
        label: "при відокремленому означенні",
      },
      {
        id: 3,
        label: "між частинами складнопідрядного речення",
      },
      {
        id: 4,
        label: "між однорідними членами",
      },
    ],
    answer: "при відокремленому означенні",
  },
  {
    id: 5,
    type: "single",
    question:
      'Прочитайте текст: Стиль тексту\n\n(1) Чи завжди видатні компанії ухвалюють геніальні рішення?\n(2) Насправді найбільші корпорації світу зазнавали невдачі зі своїми новими ідеями.\n(3) Так компанія "Гугл" не виправдала всіх свої очікувань із новинкою – окулярами з вбудованою операційною системою.\n(4) Користувачі просто не захотіли постійно носити на обличчі те, що має свої "МІЗКИ".\n(5) А УПРАВЛІННЯ з аеронавтики "Наса" запускало близько 50 космічних апаратів, які навіть не змогли подолати силу земного тяжіння й вибухали на ...... для старту.\n(6) Так само зазнала поразки і ідея "ПЕПСІ" – вони презентували прозорий напій без кофеїну, одразу відкинутий лояльною аудиторією компанії.\n(7) Що ж відрізняє великі КОМПАНІЇ у момент краху?\n(8) Вони знаходять у поразці ДОСВІД, результати і показники якого можна дослідити, оцінити і взяти в роботу для створення чогось нового.',
    options: [
      {
        id: 1,
        label: "науково-публіцистичний",
      },
      {
        id: 2,
        label: "художній",
      },
      {
        id: 3,
        label: "розмовний",
      },
      {
        id: 4,
        label: "офіційно-діловий",
      },
    ],
    answer: "науково-публіцистичний",
  },
  {
    id: 6,
    type: "single",
    question: "ПОМИЛКУ в позначенні наголосу допущено в рядку",
    options: [
      {
        id: 1,
        label: "ярмаркОвий, тИгровий",
      },
      {
        id: 2,
        label: "наскрІзний, підОшва",
      },
      {
        id: 3,
        label: "магістЕрський, мАркетинг",
      },
      {
        id: 4,
        label: "позАторік, шелюгА",
      },
    ],
    answer: "наскрІзний, підОшва",
  },
  {
    id: 7,
    type: "single",
    question: "Однакова кількість букв і звуків в кожному слові рядка",
    options: [
      {
        id: 1,
        label: "коріння, лисячий, крамниця",
      },
      {
        id: 2,
        label: "озброєння, порічка, щільненькою",
      },
      {
        id: 3,
        label: "перемичці, прудкий, зав'язь",
      },
      {
        id: 4,
        label: "баластний, ночівля, мандрують",
      },
    ],
    answer: "озброєння, порічка, щільненькою",
  },
  {
    id: 8,
    type: "single",
    question: "Суфікс -ок- має однакове значення в усіх словах, ОКРІМ",
    options: [
      {
        id: 1,
        label: "ковток",
      },
      {
        id: 2,
        label: "синок",
      },
      {
        id: 3,
        label: "чайок",
      },
      {
        id: 4,
        label: "сніжок",
      },
    ],
    answer: "ковток",
  },
  {
    id: 9,
    type: "single",
    question: "НЕМАЄ орфографічних помилок у словах рядка",
    options: [
      {
        id: 1,
        label: "техногенний, блищати, христини, козуля",
      },
      {
        id: 2,
        label: "диригент, комизливий, щебетання, кешеньковий",
      },
      {
        id: 3,
        label: "дощемір, пріоритет, вовчисько, летовище",
      },
      {
        id: 4,
        label: "прищичок, шершавенький, подільський, президія",
      },
    ],
    answer: "прищичок, шершавенький, подільський, президія",
  },
  {
    id: 10,
    type: "single",
    question: "За допомогою суфікса -ОВ- утворені всі прикметники рядка",
    options: [
      {
        id: 1,
        label: "кварц..вий, алюміні..вий, служб..вий",
      },
      {
        id: 2,
        label: "грош..вий, виставк..вий, тавн..вий",
      },
      {
        id: 3,
        label: "реч..вий, меж..вий, вечор..вий",
      },
      {
        id: 4,
        label: "яблун..вий, двор..вий, взірц..вий",
      },
    ],
    answer: "реч..вий, меж..вий, вечор..вий",
  },
  {
    id: 11,
    type: "single",
    question: "Орфографічну помилку у спрощенні на письмі допущено в рядку",
    options: [
      {
        id: 1,
        label: "шістнадцятирічній бандуристці",
      },
      {
        id: 2,
        label: "пристрастній артистці",
      },
      {
        id: 3,
        label: "капосному прихвосню",
      },
      {
        id: 4,
        label: "компостному капусняку",
      },
      {
        id: 5,
        label: "баластні тижні",
      },
    ],
    answer: "пристрастній артистці",
  },
  {
    id: 12,
    type: "single",
    question: "Граматичну помилку у формі числівника допущено в рядку",
    options: [
      {
        id: 1,
        label: "святкувати сімдесятиріччя",
      },
      {
        id: 2,
        label: "повернутися без семиста гривень",
      },
      {
        id: 3,
        label: "для п'ятсот шостого студента",
      },
      {
        id: 4,
        label: "з'їхати сорока спусками",
      },
      {
        id: 5,
        label: "на семистах спусках",
      },
    ],
    answer: "повернутися без семиста гривень",
  },
  {
    id: 13,
    type: "single",
    question: "Подовження літер НЕ відбувається в усіх словах рядка",
    options: [
      {
        id: 1,
        label: "ім..ігрант, ім..унітет, фін..ський",
      },
      {
        id: 2,
        label: "телеграм..а, ем..іграція, ак..омпанемент",
      },
      {
        id: 3,
        label: "ін..овація, шас..і, ат..аше",
      },
      {
        id: 4,
        label: "лібрет..о, кол..ектив, марок..анець",
      },
      {
        id: 5,
        label: "стокат..о, мадон..а, груп..а",
      },
    ],
    answer: "телеграм..а, ем..іграція, ак..омпанемент",
  },
  {
    id: 14,
    type: "single",
    question: "Усі слова пишуться з великої літери в рядку",
    options: [
      {
        id: 1,
        label: "(з)апорозька (с)іч, (к)иївський (л)ітопис",
      },
      {
        id: 2,
        label: "(с)вяте (п)исьмо, (н)ародний (а)ртист (у)країни",
      },
      {
        id: 3,
        label: "(д)анило (г)алицький, (д)ень (у)чителя",
      },
      {
        id: 4,
        label: "(д)ень (н)езалежності (у)країни, (о)дещина",
      },
      {
        id: 5,
        label: "(п)алац (с)порту, (м)ала (в)одолага",
      },
    ],
    answer: "(д)ень (н)езалежності (у)країни, (о)дещина",
  },
  {
    id: 15,
    type: "single",
    question:
      "Прочитайте речення, у якому пропущено окремі слова. Правильним є варіант послідовного заповнення пропусків.\n\n→ Цікаво, що _______ _______ авто з'являється ще в ХХ столітті, але без частини _______.",
    options: [
      {
        id: 1,
        label: "саморобний швидкісний, кузова",
      },
      {
        id: 2,
        label: "саморобне швидкісне, кузова",
      },
      {
        id: 3,
        label: "саморобне швидкістне, кувозу",
      },
      {
        id: 4,
        label: "саморобний швидкістний, кузова",
      },
      {
        id: 5,
        label: "само робне швидкісне, кузову",
      },
    ],
    answer: "саморобне швидкісне, кузова",
  },
  {
    id: 16,
    type: "single",
    question:
      "Прочитайте речення, у якому пропущено окремі слова. Правильним є варіант послідовного заповнення пропусків.\n\n→ Нам подали _______ фугу та _______ рагу —  _______страви в цьому ресторані.",
    options: [
      {
        id: 1,
        label: "смажене, овочеве, найбільш смачніші",
      },
      {
        id: 2,
        label: "смажену, овочевий, найсмачніші",
      },
      {
        id: 3,
        label: "смажену, овочеве, самі смачні",
      },
      {
        id: 4,
        label: "смажене, овочеве, найбільш смачні",
      },
      {
        id: 5,
        label: "смажену, овочеве, найсмачніші",
      },
    ],
    answer: "смажену, овочеве, найсмачніші",
  },
  {
    id: 17,
    type: "single",
    question:
      "Прочитайте речення, у якому пропущено окремі слова. Правильним є варіант послідовного заповнення пропусків.\n\n→ До Макса _____________ старший викладач мав понад ___________ запитань про ___________________.",
    options: [
      {
        id: 1,
        label: "Ткаченко, сімдесяти, стресостійкість",
      },
      {
        id: 2,
        label: "Ткаченка, сімдесяти, стресостійкість",
      },
      {
        id: 3,
        label: "Ткаченка, семидесяти, стрессостійкість",
      },
      {
        id: 4,
        label: "Ткаченко, сімдесят, стресо-стійкість",
      },
      {
        id: 5,
        label: "Ткаченка, сімдесят, стресостійкість",
      },
    ],
    answer: "Ткаченка, сімдесят, стресостійкість",
  },
  {
    id: 18,
    type: "single",
    question:
      "Прочитайте речення, у якому пропущено окремі слова. Правильним є варіант послідовного заповнення пропусків.\n\n→ Незалежно від кількості ____________ у документі ця комбінація клавіш стане в ___________: одним натиском ви ___________ потрібне вам слово жирним шрифтом.",
    options: [
      {
        id: 1,
        label: "аркушів, пригоді, виділете",
      },
      {
        id: 2,
        label: "аркушей, нагоді, виділите",
      },
      {
        id: 3,
        label: "аркушей, пригоді, виділете",
      },
      {
        id: 4,
        label: "аркушів, нагоді, виділите",
      },
      {
        id: 5,
        label: "аркушів, пригоді, виділите",
      },
    ],
    answer: "аркушів, пригоді, виділите",
  },
  {
    id: 19,
    type: "single",
    question:
      "Прочитайте речення, у якому пропущено окремі слова. Правильним є варіант послідовного заповнення пропусків.\n\n→ __________________ факт: листя смородини __________ відновити баланс вітаміну С в організмі та знизити рівень ________________.",
    options: [
      {
        id: 1,
        label: "Загальновідомий, здатні, холестерину",
      },
      {
        id: 2,
        label: "Загально відомий, здатне, холестерина",
      },
      {
        id: 3,
        label: "Загально відомий, здатні, холестерину",
      },
      {
        id: 4,
        label: "Загальновідомий, здатне, холестерину",
      },
      {
        id: 5,
        label: "Загально-відомий, здатне, холестерина",
      },
    ],
    answer: "Загальновідомий, здатне, холестерину",
  },
  {
    id: 20,
    type: "single",
    question:
      "Прочитайте речення. Замість пропуску можуть стояти всі слова, ОКРІМ:\n\nДідусь, [...] втому, продовжив їхати.",
    options: [
      {
        id: 1,
        label: "незважаючи на",
      },
      {
        id: 2,
        label: "не дивлячись на",
      },
      {
        id: 3,
        label: "забувши про",
      },
      {
        id: 4,
        label: "подолавши",
      },
      {
        id: 5,
        label: "попри",
      },
    ],
    answer: "не дивлячись на",
  },
  {
    id: 21,
    type: "single",
    question:
      "Відокремленим означенням НЕ МОЖНА замінити підрядну частину в реченні",
    options: [
      {
        id: 1,
        label:
          "Гостей заходу вразили стародавні частини скульптур, що їх було знайдено під час подорожі Південною Україною.",
      },
      {
        id: 2,
        label:
          "У саду лежало золоте листя фруктових дерев, яке опало ще два тижні тому.",
      },
      {
        id: 3,
        label:
          "Учні захоплено роздивлялися стінку, яку розфарбували надзвичайно гарними візерунками.",
      },
      {
        id: 4,
        label:
          "Яструб – хижий птах, який полює на дрібних птахів та ссавців на відкритих лісових галявинах.",
      },
    ],
    answer:
      "Яструб – хижий птах, який полює на дрібних птахів та ссавців на відкритих лісових галявинах.",
  },
  {
    id: 22,
    type: "single",
    question:
      "Граматично правильне продовження речення «Слухаючи твої пісні,...» наведено в рядку:",
    options: [
      {
        id: 1,
        label: "у мене покращився настрій.",
      },
      {
        id: 2,
        label: "мені згадались давні пригоди.",
      },
      {
        id: 3,
        label: "сон охопив мене.",
      },
      {
        id: 4,
        label: "є змога відпочити.",
      },
      {
        id: 5,
        label: "знову згадую події минулого.",
      },
    ],
    answer: "знову згадую події минулого.",
  },
  {
    id: 23,
    type: "single",
    question:
      "Прочитайте уривок. Дефіс треба ставити на місці цифри:\n\nУ світло(1)сірому сяйві пів(2)місяця виблискують білосніжні квіти, по(3)тихеньку прокидається ліс, а на самому край(4)небі пасуться тепло(5)любні олені.",
    options: [
      {
        id: 1,
        label: "1",
      },
      {
        id: 2,
        label: "2",
      },
      {
        id: 3,
        label: "3",
      },
      {
        id: 4,
        label: "4",
      },
      {
        id: 5,
        label: "5",
      },
    ],
    answer: "1",
  },
  {
    id: 24,
    type: "single",
    question: "Дієприкметник є в реченні:",
    options: [
      {
        id: 1,
        label: "Жива ця стежка, не затоптали її ще невігласи!",
      },
      {
        id: 2,
        label: "Любив я, сидячи за комп'ютером, розглядати інші планети.",
      },
      {
        id: 3,
        label:
          "Шаленим став його погляд, що сповнювався то презирством, то мимолітною насмішкою.",
      },
      {
        id: 4,
        label:
          "Зазеленіли дерева весною, натякаючи на безмежну циклічність життя.",
      },
      {
        id: 5,
        label: "Забігали обличчя посумнілі по вагонах довгих метро.",
      },
    ],
    answer: "Забігали обличчя посумнілі по вагонах довгих метро.",
  },
  {
    id: 25,
    type: "single",
    question: "Складним є речення:",
    options: [
      {
        id: 1,
        label:
          "Поблизу університету розтанцьовані під гучну музику бандуриста студенти запізнювалися на пари.",
      },
      {
        id: 2,
        label:
          "На величезному, просто безкрайому бульварі можна було загубитися, втратити себе і віднайти знову.",
      },
      {
        id: 3,
        label: "Як прокидаєшся ти до сонця обличчям, то й день веселий.",
      },
      {
        id: 4,
        label:
          "Стояла тиша загрозлива, напружена, натякала на неприємні звістки з деканату.",
      },
      {
        id: 5,
        label:
          "Стаття, вміщуючи в собі відгук на спектакль, зовсім не розкривала особливості акторського складу.",
      },
    ],
    answer: "Як прокидаєшся ти до сонця обличчям, то й день веселий.",
  },
  {
    id: 26,
    type: "matching",
    question:
      "Установіть відповідність між односкладними реченнями та їх видами.",
    pairs: {
      left: [
        "1. Означено-особове",
        "2. Неозначено-особове",
        "3. Називне",
        "4. Безособове речення",
      ],
      right: [
        "А. Страждаю, мучусь, і живу, і гину, благословляю біль твоїх тенет.",
        "Б. Чи про мої перемоги згадають так само, як про поразки?",
        "В. Сніжило, крутило, замітало за вікном.",
        "Г. Моя міцна, непохитна совість.",
        "Д. За калиною коротенька стежка.",
      ],
    },
    answer: {
      1: "А",
      2: "Б",
      3: "Г",
      4: "В",
    },
  },
  {
    id: 27,
    type: "matching",
    question: "Доберіть приклад до кожного виду відокремленого члена речення.",
    pairs: {
      left: ["1. додаток", "2. означення", "3. обставина", "4. прикладка"],
      right: [
        "А. Скляний хмарочос, побудований просто в центрі.",
        "Б. Той віночок, казали старі люди, міг і долю твою наворожити, і на судженого вказати.",
        "В. Здається, готуючись до іспиту, Тарас забув відпочивати.",
        "Г. Окрім скрипки, не мав він відради, не було в нього втіхи.",
        "Д. На площі він, відважних народів гімн, лунав ще більш урочисто!",
      ],
    },
    answer: {
      1: "Г",
      2: "А",
      3: "В",
      4: "Д",
    },
  },
  {
    id: 28,
    type: "matching",
    question: "Доберіть приклад до кожної умови вживання тире.",
    pairs: {
      left: [
        "1. тире при однорідних членах",
        "2. тире між підметом і присудком",
        "3. тире при відокремленому означенні",
        "4. тире в неповному реченні",
      ],
      right: [
        "А. День, вечір, ніч, ранок - усе сумне.",
        "Б. Життя без книг - це хата без вікна.",
        "В. Щастя обіймає - нестримне і п'янке.",
        "Г. Лише ходили в перший клас - і ось вже дзвоник на прощальний вальс.",
        "Д. Для нас з тобою сила перемоги - у єдності й постійній боротьбі.",
      ],
    },
    answer: {
      1: "А",
      2: "Б",
      3: "В",
      4: "Д",
    },
  },
  {
    id: 29,
    type: "matching",
    question:
      "Установіть відповідність між виділеними словами та їхньою частиною мови.",
    pairs: {
      left: ["1. інший", "2. якось", "3. трима", "4. свинцевими"],
      right: [
        "А. займенник",
        "Б. прикметник",
        "В. дієслово",
        "Г. прислівник",
        "Д. дієприкметник (форма дієслова)",
      ],
    },
    answer: {
      1: "А",
      2: "Г",
      3: "В",
      4: "Б",
    },
  },
  {
    id: 30,
    type: "matching",
    question: "Увідповідніть фразеологізм із його значенням.",
    pairs: {
      left: [
        "1. Як за гріш маку",
        "2. Як засватана дівка",
        "3. Як батогом ляснув",
        "4. Як муха до меду",
      ],
      right: [
        "А. багато",
        "Б. мало",
        "В. несміливо",
        "Г. швидко",
        "Д. жадібно",
      ],
    },
    answer: {
      1: "А",
      2: "В",
      3: "Г",
      4: "Д",
    },
  },
];

export const uploadQuestionsUkr = async () => {
  const questionsRef = collection(db, "questionsUkr");

  // Завантажуємо кожне питання в Firebase
  for (let question of questionsUkr) {
    await setDoc(doc(questionsRef, question.id.toString()), question);
  }

  console.log("Усі питання завантажено до Firestore ✅");
};
